<?php

// проверка отправки формы методом post
if ($_SERVER['REQUEST_METHOD'] == 'POST') {
    echo "Результат: ";
}

// переменная из формы html
$year = $_POST['year'];

// валидация
if ($year == 0 || $year >= 10000) {
    die("Нарушена граница диапазона значений, введите число снова.");
}

// решение
if ($year % 100 == 0 && $year % 400 != 0) {
    echo "{$year} год - невисокосный";
}
elseif ($year % 4 == 0) {
    echo "{$year} год - високосный";
}
else {
    echo "{$year} год - невисокосный";
}